app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE (status = 0)
---
        def index
		@notes = Note.where("status = 0")

SELECT "notes".* FROM "notes"
---
	def ver_todas
          @notes = Note.all

SELECT "notes".* FROM "notes" WHERE (status = 1)
---
	def finalizeds
          @notes = Note.where("status = 1")

INSERT INTO "notes" ("titulo", "texto", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)
---
	def create
          @novo = Note.new params.require(:note).permit(:titulo, :texto)
	  @novo.status = 0
          if @novo.save then

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def show
		@selected = Note.find(params[:id])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@selected = Note.find(params[:id])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "notes" SET "titulo" = ?, "texto" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["titulo", "Agua"], ["texto", "Beber 2 litros de água por dia."], ["updated_at", "2017-12-26 16:57:55.743665"], ["id", 2]]
---
	def update
          titulo = params[:note][:titulo]
          texto= params[:note][:texto]
          @selected = Note.find(params[:id])
          @selected.update(titulo: titulo, texto:texto)

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "notes" SET "status" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["status", "1"], ["updated_at", "2017-12-26 14:22:10.214540"], ["id", 2]]
---
	def finalize
          @selected = Note.find(params[:id])
          @selected.update(status: 1)